#+title: High-throughput Stan
#+PROPERTY:  header-args:R :eval yes :cache no :results output :exports both :comments link :session *R:stats*
#+PROPERTY:  header-args:sh :eval yes
#+OPTIONS: num:nil
#+filetags: stats
#+STARTUP: entitiespretty
#+HTML_HEAD: <style type="text/css">body {font-size: 11pt; font-family: "Palatino Linotype", "Book Antiqua", Palatino, serif;margin: 30px 50px 30px 50px; }h1,h2,h3,h4,h5,h6 { font-family: Arial,Helvetica,Sans-serif; }a { text-decoration: none; }a:link { color:darkblue; } a:visited { color:darkblue; } a:hover { color:dodgerblue; }a:active { color:dodgerblue; } code {color: #602000;font-family: "Lucida Console", Monaco, monospace; font-size: 90%;}.r { color: darkred; }.ro { color: darkgreen; background-color: #eeeeee; }.r code, a code, .ro code { color: inherit; }.vigindex ul { list-style-type: none; }.vigindex ul li { list-style: none; }.vigindex a code { color: inherit; }.vigindex li code { color: inherit; }</style>
** Load the R libraries
#+begin_src R
library(rstan)
library(brms)
#+end_src

#+RESULTS:
#+begin_example
Loading required package: StanHeaders
Loading required package: ggplot2
rstan (Version 2.19.2, GitRev: 2e1f913d3ca3)
For execution on a local, multicore CPU with excess RAM we recommend calling
options(mc.cores = parallel::detectCores()).
To avoid recompilation of unchanged Stan programs, we recommend calling
rstan_options(auto_write = TRUE)

Loading required package: Rcpp
Loading 'brms' package (version 2.9.0). Useful instructions
can be found by typing help('brms'). A more detailed introduction
to the package is available through vignette('brms_overview').

Attaching package: ‘brms’

The following object is masked from ‘package:rstan’:

    loo
#+end_example

: rstan_options(auto_write = TRUE)

** send stancode and standata to submit server
You will need to change your username and the submit server name.
*Note*, I previously created a directory called "stan" in my home
directory on the submit server.
#+begin_src sh :session *a* :results verbatim
rsync -avz stancode.stan erker@townsend-submit.chtc.wisc.edu:~/stan/
rsync -avz standata.dat erker@townsend-submit.chtc.wisc.edu:~/stan/
#+end_src

#+RESULTS:
#+begin_example
erker@townsend-submit.chtc.wisc.edu's password: 
building file list ... done

sent 84 bytes  received 20 bytes  41.60 bytes/sec
total size is 2600  speedup is 25.00
erker@townsend-submit.chtc.wisc.edu's password: 
building file list ... done
standata.dat

sent 822 bytes  received 42 bytes  345.60 bytes/sec
total size is 3367  speedup is 3.90
#+end_example

** shell wrapper script.

The hardest part of this for me was figuring out the paths correctly
for my wrapper script.  With the docker image that I use, CmdStan is
in the root, "/", directory on the execute node, but the stan code and
data get copied to a temporary directory.  The key was figuring out
the =cp= command with the correct slashes and dots.

This script takes a single argument which gets inserted into the
output file.  This way the samples from each chain or each model can
be identified (and they don't overwrite one another since the default
output would all be the same).

#+BEGIN_SRC sh :tangle stan.sh
#!/bin/bash

# zero is not valid value for "id", so add one
n=$(( $1 + 1 ))

# copy the contents of cmdstan into the temp directory created on execute node 
# (because I can't modify files outside this dir)
# the "/." at end of cmdstan directory copies the contents of the directory.
cp -r /cmdstan-2.18.1/. .

# compile the stan model
make stancode

# sample from posterior
./stancode sample random seed=12345 id=$n data file=standata.dat output file=samples-$1.csv

#bin/stansummary samples-$1.csv  # if you want to look at summary printed

#+END_SRC

#+RESULTS:

Make the script executable
#+BEGIN_SRC sh :session *a*
chmod +x stan.sh
#+END_SRC

#+RESULTS:
: You have new mail in /var/mail/erker

send the wrapper script to the submit node (again, you'll have to
change username and submit server).
#+BEGIN_SRC sh :session *a* :results verbatim
rsync -avz stan.sh erker@townsend-submit.chtc.wisc.edu:~/stan/
#+END_SRC

#+RESULTS:
: erker@townsend-submit.chtc.wisc.edu's password: 
: building file list ... done
: stan.sh
: 
: sent 437 bytes  received 48 bytes  194.00 bytes/sec
: total size is 542  speedup is 1.12

** Submit file
This is the contents of the submit file, stan.sub.  Note that in this
case, the queue statement specifies the number of chains to run and
the =$(Process)= variable is the argument to the bash executable so
output for each chain is saved as "sample-$(Process).csv"
(sample-0.csv, sample-1.csv, ...).
#+BEGIN_SRC sh :tangle stan.sub

universe = docker
docker_image = tedwarderker/cmdstan-docker:1.0

executable = stan.sh 
arguments = $(Process)
transfer_input_files = stancode.stan, standata.dat, stan.sh
transfer_output_files = samples-$(Process).csv

output = stan.out
error = stan.err
log = stan.log

request_cpus = 1
request_memory = 4GB
request_disk = 100MB

queue 4

#+END_SRC

#+RESULTS:

I created the submit file locally, so I'll send it to the submit server.
#+BEGIN_SRC sh :session *a* :results verbatim
  rsync -avz stan.sub erker@townsend-submit.chtc.wisc.edu:~/stan/
#+END_SRC

#+RESULTS:
: erker@townsend-submit.chtc.wisc.edu's password: 
: building file list ... done
: stan_test.sub
: 
: sent 328 bytes  received 48 bytes  150.40 bytes/sec
: total size is 338  speedup is 0.90

** Submit the job
#+BEGIN_SRC sh :session *submit* :results verbatim

  # log into submit server
  ssh erker@townsend-submit.chtc.wisc.edu

  # go into "stan" directory
  cd stan

  #submit
  condor_submit stan.sub

#+END_SRC

#+RESULTS:
#+begin_example
You have new mail in /var/mail/erker
erker@townsend-submit.chtc.wisc.edu's password: 
Last failed login: Sun Aug 25 14:19:19 CDT 2019 from 10.130.188.148 on ssh:notty
There were 2 failed login attempts since the last successful login.
Last login: Fri Aug 23 17:00:09 2019 from townsend-submit.chtc.wisc.edu
_____________________________________________________________________
####  #     # #######  #####  Issues?  Email chtc@cs.wisc.edu
# #     #    #    #     # Unauthorized use prohibited by:
#     #    #    #       WI Statutes: s. 947.0125
#######    #    #       U.S. Code: 18 USC 1030
#     #    #    #       U.S. Code: 18 USC 2510-2522
# #     #    #    #     # U.S. Code: 18 USC 2701-2712
####  #     #    #     #####  U.S. Code: 18 USC § 1831
For off campus ssh access use https://www.doit.wisc.edu/network/vpn/
_____________________________________________________________________
-bash-4.2$ -bash-4.2$ -bash-4.2$ -bash-4.2$ -bash-4.2$ Submitting job(s)....
4 job(s) submitted to cluster 22355.
#+end_example

** copy stan output back locally and read into R
#+BEGIN_SRC sh :session *a* :results verbatim

rsync -avz erker@townsend-submit.chtc.wisc.edu:~/stan/samples*.csv .

#+END_SRC

#+RESULTS:
: erker@townsend-submit.chtc.wisc.edu's password: 
: receiving file list ... done
: samples-0.csv
: samples-1.csv
: samples-2.csv
: samples-3.csv
: 
: sent 28712 bytes  received 2893748 bytes  649435.56 bytes/sec
: total size is 10013764  speedup is 3.43

#+BEGIN_SRC R
library(rstan)
samples <- list.files(".", pattern = "samples*")
o <- read_stan_csv(samples)
#+END_SRC

#+RESULTS:

#+begin_src R :eval no
o
summary(o)$summary[1:10,1:10]
#+end_src

#+RESULTS:
#+begin_example
Inference for Stan model: samples-0.
4 chains, each with iter=2000; warmup=1000; thin=1; 
post-warmup draws per chain=1000, total post-warmup draws=4000.

                       mean      se_mean          sd          2.5%          25%
b[1]            0.014194688 0.0005661135 0.024790630 -0.0344421125 -0.002480430
b[2]            2.422870105 0.0252287566 1.151055544  0.1914248250  1.638045000
b[3]           -0.394428992 0.0097430615 0.523699835 -1.4305587500 -0.737801500
b[4]           -0.511399846 0.0090475028 0.512176144 -1.5251375000 -0.851264500
b[5]            0.617380294 0.0134344151 0.733863417 -0.7827072000  0.128978000
b[6]           -0.021530512 0.0005801794 0.026314898 -0.0734698625 -0.039393375
temp_Intercept  4.260468235 0.0028010795 0.176362301  3.9162730000  4.145770000
sigma           1.145705235 0.0023240838 0.128933331  0.9087394000  1.052320000
sd_1[1]         0.403863687 0.0072012656 0.283420675  0.0174440725  0.176523000
sd_1[2]         0.008364407 0.0001738388 0.006068026  0.0004087107  0.003542147
.....
.....
.....
                        50%         75%      97.5%    n_eff      Rhat
b[1]            0.014309350  0.03067600 0.06329140 1917.644 1.0028182
b[2]            2.433125000  3.19454750 4.69593250 2081.617 1.0028769
b[3]           -0.396035000 -0.04641590 0.62570045 2889.176 1.0001599
b[4]           -0.515040000 -0.17024825 0.50931083 3204.655 1.0001544
b[5]            0.619476500  1.12000500 2.03235200 2983.960 0.9996913
b[6]           -0.021465000 -0.00365180 0.02952938 2057.211 1.0030758
temp_Intercept  4.255230000  4.37055750 4.61938350 3964.247 1.0003107
sigma           1.135975000  1.22838000 1.42374375 3077.704 0.9999579
sd_1[1]         0.360827500  0.58422875 1.06309875 1548.979 1.0003732
sd_1[2]         0.007282805  0.01200718 0.02253319 1218.432 1.0032349
.....
.....
.....
Samples were drawn using NUTS(diag_e) at Wed Aug 28 11:25:49 2019.
For each parameter, n_eff is a crude measure of effective sample size,
and Rhat is the potential scale reduction factor on split chains (at 
convergence, Rhat=1).

#+end_example

*** read in data
#+begin_src R
  library(dplyr)
  d <- readRDS("../allo/data/age_dbh_testing_noWARO.rds") %>%
    mutate_if(is.character, as.factor)
  str(d)
#+end_src

#+RESULTS:
#+begin_example

Classes ‘tbl_df’, ‘tbl’ and 'data.frame':	5381 obs. of  11 variables:
 $ Region        : Factor w/ 15 levels "CenFla","GulfCo",..: 4 4 4 4 4 4 4 4 4 4 ...
 $ City          : Factor w/ 15 levels "Albuquerque, NM",..: 11 11 11 11 11 11 11 11 11 11 ...
 $ Species       : Factor w/ 24 levels "ACPL","ACRU",..: 3 6 10 11 12 13 15 16 17 18 ...
 $ DBH           : num  2.5 2.5 2.5 2.5 2.5 2.5 2.5 2.5 2.5 2.5 ...
 $ AGE           : int  0 0 0 0 0 0 0 0 0 0 ...
 $ ScientificName: Factor w/ 24 levels "Acer platanoides",..: 3 6 10 11 12 13 14 16 17 18 ...
 $ Genus         : Factor w/ 17 levels "Acer","Celtis",..: 1 3 5 6 7 8 9 11 12 13 ...
 $ gdd           : num  5.75 5.75 5.75 5.75 5.75 ...
 $ precip        : num  1.31 1.31 1.31 1.31 1.31 ...
 $ Longitude     : num  -121 -121 -121 -121 -121 ...
 $ Latitude      : num  37.6 37.6 37.6 37.6 37.6 ...
#+end_example


** send to submit server


#+BEGIN_SRC sh :session *a* :results verbatim

  rsync -avz allo/allo* erker@townsend-submit.chtc.wisc.edu:~/allo/

#+END_SRC

#+RESULTS:
: erker@townsend-submit.chtc.wisc.edu's password: 
: building file list ... done
: 
: sent 281 bytes  received 20 bytes  66.89 bytes/sec
: total size is 5938880  speedup is 19730.50


** read into R

#+begin_src R

    m1$fit <- list.files("allo/", pattern = "samples-1-*", full.names = T) %>% 
        read_stan_csv()
    m1 <- brms:::rename_pars(m1)
    summary(m1)

#+end_src

#+RESULTS:
#+begin_example

 Family: gamma 
  Links: mu = identity; shape = identity 
Formula: DBH ~ b0 + 100 * b1 * (1 - exp(-(b2/100) * AGE^(b3))) 
         b0 ~ 1
         b1 ~ 1
         b2 ~ 1
         b3 ~ 1
   Data: d (Number of observations: 5381) 
Samples: 4 chains, each with iter = 2000; warmup = 1000; thin = 1;
         total post-warmup samples = 4000

Population-Level Effects: 
             Estimate Est.Error l-95% CI u-95% CI Eff.Sample Rhat
b0_Intercept     2.79      0.08     2.64     2.95       2323 1.00
b1_Intercept     1.11      0.05     1.02     1.21       1735 1.00
b2_Intercept     0.99      0.03     0.92     1.06       2157 1.00
b3_Intercept     1.14      0.02     1.11     1.17       1746 1.00

Family Specific Parameters: 
      Estimate Est.Error l-95% CI u-95% CI Eff.Sample Rhat
shape     8.00      0.15     7.71     8.30       2396 1.00

Samples were drawn using sample(hmc). For each parameter, Eff.Sample 
is a crude measure of effective sample size, and Rhat is the potential 
scale reduction factor on split chains (at convergence, Rhat = 1).
#+end_example

#+begin_src R
    m2$fit <- list.files("allo/", pattern = "samples-2-*", full.names = T) %>% 
        read_stan_csv()
    m2 <- brms:::rename_pars(m2)
    summary(m2)

#+end_src

#+RESULTS:
#+begin_example

 Family: gamma 
  Links: mu = identity; shape = identity 
Formula: DBH ~ b0 + 100 * b1 * (1 - exp(-(b2/100) * AGE^(b3))) 
         b0 ~ (1 | City)
         b1 ~ (1 | City)
         b2 ~ (1 | City)
         b3 ~ (1 | City)
   Data: d (Number of observations: 5381) 
Samples: 3 chains, each with iter = 2000; warmup = 1000; thin = 1;
         total post-warmup samples = 3000

Group-Level Effects: 
~City (Number of levels: 15) 
                 Estimate Est.Error l-95% CI u-95% CI Eff.Sample Rhat
sd(b0_Intercept)     0.61      0.10     0.43     0.83       1354 1.00
sd(b1_Intercept)     0.15      0.05     0.06     0.24       1282 1.00
sd(b2_Intercept)     0.15      0.02     0.12     0.18       2293 1.00
sd(b3_Intercept)     0.10      0.01     0.07     0.13       1573 1.00

Population-Level Effects: 
             Estimate Est.Error l-95% CI u-95% CI Eff.Sample Rhat
b0_Intercept     2.69      0.19     2.32     3.06       1048 1.00
b1_Intercept     1.30      0.08     1.16     1.48       1606 1.00
b2_Intercept     0.88      0.05     0.78     0.98       1460 1.00
b3_Intercept     1.13      0.03     1.07     1.20       1092 1.00

Family Specific Parameters: 
      Estimate Est.Error l-95% CI u-95% CI Eff.Sample Rhat
shape    10.54      0.20    10.16    10.94       4720 1.00

Samples were drawn using sample(hmc). For each parameter, Eff.Sample 
is a crude measure of effective sample size, and Rhat is the potential 
scale reduction factor on split chains (at convergence, Rhat = 1).
#+end_example


#+begin_src R
    library(loo)

  m1loo <- loo(m1)
  m2loo <- loo(m2)

  comparison <- compare(x = list(m1loo, m2loo))

#+end_src

#+begin_src R
comparison
#+end_src

#+RESULTS:
: elpd_diff        se 
:     748.6      40.5

The second model is better.

